'''
За введеними координатами з'ясувати, до якої координатної чверті належить точка.
( Координати ввести з консолі, варто зауважити, що це можуть бути не лише цілі числа. Опрацювати варіант, коли точка- початок координат або лежить на осі )
'''
x1 = float(input('Введіть значення x1'))
y1 = float(input('Введіть значення y1'))
if x1 > 0 and y1 > 0:
    print('Точка в першій координатній чверті')
elif x1 < 0 and y1 > 0:
    print('Точка в другій координатній чверті')
elif x1 < 0 and y1 < 0:
    print('Точка в третій координатній чверті')
elif x1 > 0 and y1 < 0:
    print('Точка в четвертій координатній чверті')
elif x1 == 0 and y1 == 0:
    print('Точка початку координат')
elif x1 == 0:
    print('Точка лежить на осі Y')
elif y1 == 0:
    print('Точка лежить на осі X')